org/posts/linux-os.org
#+TITLE: Linux OS
#+DATE: 2026-06-17
#+TAGS: Linux
#+DESCRIPTION: A comprehensive Q&A covering Linux OS from beginner to advanced level.
#+OPTIONS: toc:nil num:nil html-postamble:nil
#+HTML_HEAD: <link rel="stylesheet" href="/static/css/style.css" type="text/css"/>

#+INCLUDE: "../header.org"

* Linux OS Q&A (Beginner to Advanced)

A comprehensive question and answer guide for Linux Operating System — from the very basics to advanced topics.
Use it to study, review, or prepare for interviews.

-----

* Beginner

** Q: What is Linux?

Linux is a free, open-source operating system kernel created by Linus Torvalds in 1991.
It manages hardware resources and allows software applications to run on a computer.
Linux is Unix-like and forms the core of many operating systems called Linux distributions (Ubuntu, CentOS, Fedora, etc.).

** Q: What is the difference between Linux and other operating systems?

- *Free and Open Source* — Source code is publicly available
- *Multi-user* — Multiple users can use system simultaneously
- *Multitasking* — Multiple programs run at the same time
- *Portable* — Runs on various hardware platforms
- *Secure* — User accounts, file permissions, encryption
- *Stable* — Can run for years without restart
- *Flexible* — Can be customized for various purposes

** Q: What is a Linux distribution?

A Linux distribution is a complete operating system built around the Linux kernel, including:

- Linux kernel
- GNU tools and utilities
- Package manager
- Pre-installed software
- Init system
- Desktop environment (optional)

Popular distributions: Ubuntu, Debian, CentOS, Fedora, Red Hat Enterprise Linux (RHEL), Arch Linux, Slackware, openSUSE

** Q: What is a terminal or shell?

A terminal is a text-based interface where you interact with the operating system.
A shell is a command-line interpreter that processes your commands.
Common shells include Bash (Bourne Again Shell), Zsh, Fish, and Ksh.

** Q: What are the basic Linux commands?

Essential commands include:

| Command | Purpose                      |
|---------+------------------------------|
| ls      | list directory contents      |
| pwd     | print working directory      |
| cd      | change directory             |
| mkdir   | create a directory           |
| rmdir   | remove empty directory       |
| touch   | create an empty file         |
| cat     | display file contents        |
| cp      | copy files                   |
| mv      | move/rename files            |
| rm      | remove files                 |
| sudo    | execute as superuser         |
| man     | display manual pages         |
| which   | locate a command             |
| alias   | create command shortcuts     |

** Q: How do I get help on a command?

Multiple ways:

#+BEGIN_SRC bash
man command_name              # Full manual page
command_name --help           # Quick help
command_name -h               # Quick help (alternative)
info command_name             # Info page (more detailed)
whatis command_name           # One-line description
apropos keyword               # Search by keyword
#+END_SRC

** Q: What is the Linux file system hierarchy?

Linux follows the Filesystem Hierarchy Standard (FHS):

| Directory   | Purpose                                |
|-------------+----------------------------------------|
| /           | Root directory, top of file system     |
| /bin        | Essential command binaries             |
| /sbin       | System administration binaries         |
| /boot       | Boot files and kernel image            |
| /dev        | Device files                           |
| /etc        | System configuration files             |
| /home       | User home directories                  |
| /lib        | Essential shared libraries             |
| /lib64      | 64-bit shared libraries                |
| /media      | Mount points for removable media       |
| /mnt        | Mount points for temporary filesystems |
| /opt        | Optional third-party software          |
| /proc       | Virtual filesystem with process info   |
| /root       | Root user's home directory             |
| /run        | Runtime data (PID files, sockets)      |
| /srv        | Service data                           |
| /sys        | Virtual filesystem for hardware info   |
| /tmp        | Temporary files (cleared on reboot)    |
| /usr        | User programs and data                 |
| /var        | Variable data (logs, caches, mail)     |

** Q: What is the difference between relative and absolute paths?

- *Absolute paths* start with =/= and specify the complete path from root
  #+BEGIN_SRC bash
  /home/user/documents/file.txt
  #+END_SRC
  Always work regardless of current directory

- *Relative paths* are relative to the current directory
  #+BEGIN_SRC bash
  documents/file.txt
  ../documents/file.txt
  #+END_SRC
  Depend on current working directory
  ~.~ represents current directory, ~..~ represents parent directory

