public/posts/linux-os.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linux OS</title>
<meta name="description" content="A comprehensive Q&amp;A covering Linux OS from beginner to advanced level." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css"/>
<link rel="stylesheet" href="/static/css/style.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Linux OS</h1>
</header><div class="site-header">
  <div class="site-title"><a href="/">Borislav Dostumski</a></div>
  <nav class="site-nav">
    <a href="/index.html">Index</a>
    <a href="/certificates.html">Certificates</a>
    <a href="/blog.html">Blog</a>
    <a href="/about.html">Bio</a>
  </nav>
</div>
<div id="outline-container-org2762947" class="outline-2">
<h2 id="org2762947">Linux OS Q&amp;A (Beginner to Advanced)</h2>
<div class="outline-text-2" id="text-org2762947">
<p>
A comprehensive question and answer guide for Linux Operating System — from the very basics to advanced topics.
Use it to study, review, or prepare for interviews.
</p>

<hr>
</div>
</div>
<div id="outline-container-orgc582444" class="outline-2">
<h2 id="orgc582444">Beginner</h2>
<div class="outline-text-2" id="text-orgc582444">
</div>
<div id="outline-container-org35b56f7" class="outline-3">
<h3 id="org35b56f7">Q: What is Linux?</h3>
<div class="outline-text-3" id="text-org35b56f7">
<p>
Linux is a free, open-source operating system kernel created by Linus Torvalds in 1991.
It manages hardware resources and allows software applications to run on a computer.
Linux is Unix-like and forms the core of many operating systems called Linux distributions (Ubuntu, CentOS, Fedora, etc.).
</p>
</div>
</div>
<div id="outline-container-orgf99a197" class="outline-3">
<h3 id="orgf99a197">Q: What is the difference between Linux and other operating systems?</h3>
<div class="outline-text-3" id="text-orgf99a197">
<ul class="org-ul">
<li><b>Free and Open Source</b> — Source code is publicly available</li>
<li><b>Multi-user</b> — Multiple users can use system simultaneously</li>
<li><b>Multitasking</b> — Multiple programs run at the same time</li>
<li><b>Portable</b> — Runs on various hardware platforms</li>
<li><b>Secure</b> — User accounts, file permissions, encryption</li>
<li><b>Stable</b> — Can run for years without restart</li>
<li><b>Flexible</b> — Can be customized for various purposes</li>
</ul>
</div>
</div>
<div id="outline-container-orge4c97db" class="outline-3">
<h3 id="orge4c97db">Q: What is a Linux distribution?</h3>
<div class="outline-text-3" id="text-orge4c97db">
<p>
A Linux distribution is a complete operating system built around the Linux kernel, including:
</p>

<ul class="org-ul">
<li>Linux kernel</li>
<li>GNU tools and utilities</li>
<li>Package manager</li>
<li>Pre-installed software</li>
<li>Init system</li>
<li>Desktop environment (optional)</li>
</ul>

<p>
Popular distributions: Ubuntu, Debian, CentOS, Fedora, Red Hat Enterprise Linux (RHEL), Arch Linux, Slackware, openSUSE
</p>
</div>
</div>
<div id="outline-container-org445e852" class="outline-3">
<h3 id="org445e852">Q: What is a terminal or shell?</h3>
<div class="outline-text-3" id="text-org445e852">
<p>
A terminal is a text-based interface where you interact with the operating system.
A shell is a command-line interpreter that processes your commands.
Common shells include Bash (Bourne Again Shell), Zsh, Fish, and Ksh.
</p>
</div>
</div>
<div id="outline-container-orgbcd049b" class="outline-3">
<h3 id="orgbcd049b">Q: What are the basic Linux commands?</h3>
<div class="outline-text-3" id="text-orgbcd049b">
<p>
Essential commands include:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Command</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ls</td>
<td class="org-left">list directory contents</td>
</tr>

<tr>
<td class="org-left">pwd</td>
<td class="org-left">print working directory</td>
</tr>

<tr>
<td class="org-left">cd</td>
<td class="org-left">change directory</td>
</tr>

<tr>
<td class="org-left">mkdir</td>
<td class="org-left">create a directory</td>
</tr>

<tr>
<td class="org-left">rmdir</td>
<td class="org-left">remove empty directory</td>
</tr>

<tr>
<td class="org-left">touch</td>
<td class="org-left">create an empty file</td>
</tr>

<tr>
<td class="org-left">cat</td>
<td class="org-left">display file contents</td>
</tr>

<tr>
<td class="org-left">cp</td>
<td class="org-left">copy files</td>
</tr>

<tr>
<td class="org-left">mv</td>
<td class="org-left">move/rename files</td>
</tr>

<tr>
<td class="org-left">rm</td>
<td class="org-left">remove files</td>
</tr>

<tr>
<td class="org-left">sudo</td>
<td class="org-left">execute as superuser</td>
</tr>

<tr>
<td class="org-left">man</td>
<td class="org-left">display manual pages</td>
</tr>

<tr>
<td class="org-left">which</td>
<td class="org-left">locate a command</td>
</tr>

<tr>
<td class="org-left">alias</td>
<td class="org-left">create command shortcuts</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org20b5008" class="outline-3">
<h3 id="org20b5008">Q: How do I get help on a command?</h3>
<div class="outline-text-3" id="text-org20b5008">
<p>
Multiple ways:
</p>

<div class="org-src-container">
<pre class="src src-bash">man command_name              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Full manual page
</span>command_name --help           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Quick help
</span>command_name -h               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Quick help (alternative)
</span>info command_name             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Info page (more detailed)
</span>whatis command_name           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">One-line description
</span>apropos keyword               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Search by keyword</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6b81216" class="outline-3">
<h3 id="org6b81216">Q: What is the Linux file system hierarchy?</h3>
<div class="outline-text-3" id="text-org6b81216">
<p>
Linux follows the Filesystem Hierarchy Standard (FHS):
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Directory</th>
<th scope="col" class="org-left">Purpose</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">/bin</td>
<td class="org-left">Essential command binaries</td>
</tr>

<tr>
<td class="org-left">/sbin</td>
<td class="org-left">System administration binaries</td>
</tr>

<tr>
<td class="org-left">/boot</td>
<td class="org-left">Boot files and kernel image</td>
</tr>

<tr>
<td class="org-left">/dev</td>
<td class="org-left">Device files</td>
</tr>

<tr>
<td class="org-left">/etc</td>
<td class="org-left">System configuration files</td>
</tr>

<tr>
<td class="org-left">/home</td>
<td class="org-left">User home directories</td>
</tr>

<tr>
<td class="org-left">/lib</td>
<td class="org-left">Essential shared libraries</td>
</tr>

<tr>
<td class="org-left">/lib64</td>
<td class="org-left">64-bit shared libraries</td>
</tr>

<tr>
<td class="org-left">/media</td>
<td class="org-left">Mount points for removable media</td>
</tr>

<tr>
<td class="org-left">/mnt</td>
<td class="org-left">Mount points for temporary filesystems</td>
</tr>

<tr>
<td class="org-left">/opt</td>
<td class="org-left">Optional third-party software</td>
</tr>

<tr>
<td class="org-left">/proc</td>
<td class="org-left">Virtual filesystem with process info</td>
</tr>

<tr>
<td class="org-left">/root</td>
<td class="org-left">Root user's home directory</td>
</tr>

<tr>
<td class="org-left">/run</td>
<td class="org-left">Runtime data (PID files, sockets)</td>
</tr>

<tr>
<td class="org-left">/srv</td>
<td class="org-left">Service data</td>
</tr>

<tr>
<td class="org-left">/sys</td>
<td class="org-left">Virtual filesystem for hardware info</td>
</tr>

<tr>
<td class="org-left">/tmp</td>
<td class="org-left">Temporary files (cleared on reboot)</td>
</tr>

<tr>
<td class="org-left">/usr</td>
<td class="org-left">User programs and data</td>
</tr>

<tr>
<td class="org-left">/var</td>
<td class="org-left">Variable data (logs, caches, mail)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgea105de" class="outline-3">
<h3 id="orgea105de">Q: What is the difference between relative and absolute paths?</h3>
<div class="outline-text-3" id="text-orgea105de">
<ul class="org-ul">
<li><p>
<b>Absolute paths</b> start with <code>/</code> and specify the complete path from root
</p>
<div class="org-src-container">
<pre class="src src-bash">/home/user/documents/file.txt
</pre>
</div>
<p>
Always work regardless of current directory
</p></li>

<li><p>
<b>Relative paths</b> are relative to the current directory
</p>
<div class="org-src-container">
<pre class="src src-bash">documents/file.txt
../documents/file.txt
</pre>
</div>
<p>
Depend on current working directory
<code>.</code> represents current directory, <code>..</code> represents parent directory
</p></li>
</ul>
</div>
</div>
