org/posts/linux-os.org
** Q: How do I check file permissions?

Use ~ls -l~ to view detailed file information:

#+BEGIN_SRC bash
-rw-r--r-- 1 user group 1024 Jan 15 10:30 file.txt
#+END_SRC

Breaking down permissions:
- First character: file type (=-= for file, =d= for directory, =l= for symlink)
- Next 3 characters: owner permissions (read, write, execute)
- Next 3 characters: group permissions
- Last 3 characters: others permissions

Each set uses: =r= (read=4), =w= (write=2), =x= (execute=1)

** Q: What file types exist in Linux?

- *Regular files* — Contain data (documents, images, etc.)
- *Directories* — Containers for files
- *Symbolic links* — References to other files
- *Character devices* — Devices like terminals (=/dev/tty=)
- *Block devices* — Storage devices like hard drives (=/dev/sda=)
- *Named pipes (FIFO)* — Inter-process communication
- *Sockets* — Network communication endpoints

Check file type: ~file filename~ or ~ls -l~ (first character)

** Q: What is the difference between a user and root?

- *Regular user* — Limited permissions, can only access own files, cannot install system software
- *Root (superuser)* — Unlimited permissions, can access/modify any file or system setting, UID is 0

Running as root is dangerous; use sudo for specific tasks.

** Q: How do I change file permissions?

Use the ~chmod~ command with symbolic or numeric notation:

Symbolic notation:
#+BEGIN_SRC bash
chmod u+x file.txt              # Add execute for owner
chmod g-w file.txt              # Remove write for group
chmod o=r file.txt              # Set read-only for others
chmod a-rwx file.txt            # Remove all permissions
#+END_SRC

Numeric notation (sum rwx values):
#+BEGIN_SRC bash
chmod 755 file.txt              # rwxr-xr-x (7+5+5)
chmod 644 file.txt              # rw-r--r-- (6+4+4)
chmod 700 file.txt              # rwx------ (7+0+0)
#+END_SRC

** Q: How do I change file ownership?

Use ~chown~ and ~chgrp~:

#+BEGIN_SRC bash
chown newuser file.txt              # Change owner
chown newuser:newgroup file.txt      # Change owner and group
chgrp newgroup file.txt             # Change group only
chown -R user:group directory/      # Recursive change
#+END_SRC

** Q: What is sudo and how do I use it?

~sudo~ (superuser do) allows permitted users to execute commands as another user (usually root):

#+BEGIN_SRC bash
sudo apt update                     # Run with root privileges
sudo -u username command            # Run as specific user
sudo -l                             # List permitted commands
sudo !!                             # Repeat last command with sudo
#+END_SRC

The user is prompted for their password. Configuration in =/etc/sudoers=.

** Q: What is a user group?

A group is a collection of users with shared permissions. Benefits:

- Share files and directories with multiple users
- Assign permissions to groups instead of individuals
- Easier permission management

Common groups:
- ~sudo~ — Users allowed to use sudo
- ~wheel~ — Alternative to sudo group
- ~docker~ — Users allowed to use Docker
- ~audio~, ~video~ — Multimedia device access

-----

* Intermediate

** Q: What is a package manager?

A package manager automates the installation, removal, updating, and configuration of software packages. It:

- Resolves dependencies automatically
- Maintains package database
- Enables easy software discovery
- Simplifies system maintenance

Different distributions use different package managers:

| Distribution       | Package Manager |
|--------------------+-----------------|
| Debian/Ubuntu      | apt, apt-get    |
| Red Hat/CentOS     | yum, dnf, rpm   |
| Arch Linux         | pacman          |
| openSUSE           | zypper          |

** Q: What's the difference between apt and apt-get?

~apt~ is a newer, user-friendly interface introduced to simplify package management tasks:

- ~apt~ — High-level, user-friendly commands
- ~apt-get~ — Lower-level tool with more options
- ~apt-cache~ — Separate tool for searching packages

~apt~ combines functionality from ~apt-get~ and ~apt-cache~ with better user experience, colorized output, and simplified syntax.

For most users, ~apt~ is recommended; ~apt-get~ remains available for scripts.

** Q: How do I install, update, and remove packages?

Common commands (using apt as example):

#+BEGIN_SRC bash
sudo apt update              # Update package list
sudo apt upgrade             # Upgrade all packages
sudo apt full-upgrade        # Upgrade with dependency resolution
sudo apt install package     # Install package
sudo apt remove package      # Remove package (keep config)
sudo apt purge package       # Remove package and config
sudo apt autoremove          # Remove unused dependencies
sudo apt search keyword      # Search for package
sudo apt show package        # Show package information
#+END_SRC

