public/posts/linux-os.html
<div id="outline-container-orgfbac403" class="outline-3">
<h3 id="orgfbac403">Q: How do I check file permissions?</h3>
<div class="outline-text-3" id="text-orgfbac403">
<p>
Use <code>ls -l</code> to view detailed file information:
</p>

<div class="org-src-container">
<pre class="src src-bash">-rw-r--r-- 1 user group 1024 Jan 15 10:30 file.txt
</pre>
</div>

<p>
Breaking down permissions:
</p>
<ul class="org-ul">
<li>First character: file type (<code>-</code> for file, <code>d</code> for directory, <code>l</code> for symlink)</li>
<li>Next 3 characters: owner permissions (read, write, execute)</li>
<li>Next 3 characters: group permissions</li>
<li>Last 3 characters: others permissions</li>
</ul>

<p>
Each set uses: <code>r</code> (read=4), <code>w</code> (write=2), <code>x</code> (execute=1)
</p>
</div>
</div>
<div id="outline-container-orgf7ad8b1" class="outline-3">
<h3 id="orgf7ad8b1">Q: What file types exist in Linux?</h3>
<div class="outline-text-3" id="text-orgf7ad8b1">
<ul class="org-ul">
<li><b>Regular files</b> — Contain data (documents, images, etc.)</li>
<li><b>Directories</b> — Containers for files</li>
<li><b>Symbolic links</b> — References to other files</li>
<li><b>Character devices</b> — Devices like terminals (<code>/dev/tty</code>)</li>
<li><b>Block devices</b> — Storage devices like hard drives (<code>/dev/sda</code>)</li>
<li><b>Named pipes (FIFO)</b> — Inter-process communication</li>
<li><b>Sockets</b> — Network communication endpoints</li>
</ul>

<p>
Check file type: <code>file filename</code> or <code>ls -l</code> (first character)
</p>
</div>
</div>
<div id="outline-container-orgf2d5b87" class="outline-3">
<h3 id="orgf2d5b87">Q: What is the difference between a user and root?</h3>
<div class="outline-text-3" id="text-orgf2d5b87">
<ul class="org-ul">
<li><b>Regular user</b> — Limited permissions, can only access own files, cannot install system software</li>
<li><b>Root (superuser)</b> — Unlimited permissions, can access/modify any file or system setting, UID is 0</li>
</ul>

<p>
Running as root is dangerous; use sudo for specific tasks.
</p>
</div>
</div>
<div id="outline-container-org0650e90" class="outline-3">
<h3 id="org0650e90">Q: How do I change file permissions?</h3>
<div class="outline-text-3" id="text-org0650e90">
<p>
Use the <code>chmod</code> command with symbolic or numeric notation:
</p>

<p>
Symbolic notation:
</p>
<div class="org-src-container">
<pre class="src src-bash">chmod u+x file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add execute for owner
</span>chmod g-w file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove write for group
</span>chmod <span style="font-weight: bold; font-style: italic;">o</span>=r file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set read-only for others
</span>chmod a-rwx file.txt            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove all permissions</span>
</pre>
</div>

<p>
Numeric notation (sum rwx values):
</p>
<div class="org-src-container">
<pre class="src src-bash">chmod 755 file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">rwxr-xr-x (7+5+5)
</span>chmod 644 file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">rw-r--r-- (6+4+4)
</span>chmod 700 file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">rwx------ (7+0+0)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org100f72d" class="outline-3">
<h3 id="org100f72d">Q: How do I change file ownership?</h3>
<div class="outline-text-3" id="text-org100f72d">
<p>
Use <code>chown</code> and <code>chgrp</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">chown newuser file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change owner
</span>chown newuser:newgroup file.txt      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change owner and group
</span>chgrp newgroup file.txt             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change group only
</span>chown -R user:group directory/      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Recursive change</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbab8f47" class="outline-3">
<h3 id="orgbab8f47">Q: What is sudo and how do I use it?</h3>
<div class="outline-text-3" id="text-orgbab8f47">
<p>
<code>sudo</code> (superuser do) allows permitted users to execute commands as another user (usually root):
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo apt update                     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run with root privileges
</span>sudo -u username command            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run as specific user
</span>sudo -l                             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List permitted commands
</span>sudo !!                             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Repeat last command with sudo</span>
</pre>
</div>

<p>
The user is prompted for their password. Configuration in <code>/etc/sudoers</code>.
</p>
</div>
</div>
<div id="outline-container-org604157e" class="outline-3">
<h3 id="org604157e">Q: What is a user group?</h3>
<div class="outline-text-3" id="text-org604157e">
<p>
A group is a collection of users with shared permissions. Benefits:
</p>

<ul class="org-ul">
<li>Share files and directories with multiple users</li>
<li>Assign permissions to groups instead of individuals</li>
<li>Easier permission management</li>
</ul>

<p>
Common groups:
</p>
<ul class="org-ul">
<li><code>sudo</code> — Users allowed to use sudo</li>
<li><code>wheel</code> — Alternative to sudo group</li>
<li><code>docker</code> — Users allowed to use Docker</li>
<li><code>audio</code>, <code>video</code> — Multimedia device access</li>
</ul>

<hr>
</div>
</div>
</div>
<div id="outline-container-orgfa984b0" class="outline-2">
<h2 id="orgfa984b0">Intermediate</h2>
<div class="outline-text-2" id="text-orgfa984b0">
</div>
<div id="outline-container-orgf902c67" class="outline-3">
<h3 id="orgf902c67">Q: What is a package manager?</h3>
<div class="outline-text-3" id="text-orgf902c67">
<p>
A package manager automates the installation, removal, updating, and configuration of software packages. It:
</p>

<ul class="org-ul">
<li>Resolves dependencies automatically</li>
<li>Maintains package database</li>
<li>Enables easy software discovery</li>
<li>Simplifies system maintenance</li>
</ul>

<p>
Different distributions use different package managers:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Distribution</th>
<th scope="col" class="org-left">Package Manager</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Debian/Ubuntu</td>
<td class="org-left">apt, apt-get</td>
</tr>

<tr>
<td class="org-left">Red Hat/CentOS</td>
<td class="org-left">yum, dnf, rpm</td>
</tr>

<tr>
<td class="org-left">Arch Linux</td>
<td class="org-left">pacman</td>
</tr>

<tr>
<td class="org-left">openSUSE</td>
<td class="org-left">zypper</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgaa60fb2" class="outline-3">
<h3 id="orgaa60fb2">Q: What's the difference between apt and apt-get?</h3>
<div class="outline-text-3" id="text-orgaa60fb2">
<p>
<code>apt</code> is a newer, user-friendly interface introduced to simplify package management tasks:
</p>

<ul class="org-ul">
<li><code>apt</code> — High-level, user-friendly commands</li>
<li><code>apt-get</code> — Lower-level tool with more options</li>
<li><code>apt-cache</code> — Separate tool for searching packages</li>
</ul>

<p>
<code>apt</code> combines functionality from <code>apt-get</code> and <code>apt-cache</code> with better user experience, colorized output, and simplified syntax.
</p>

<p>
For most users, <code>apt</code> is recommended; <code>apt-get</code> remains available for scripts.
</p>
</div>
</div>
<div id="outline-container-org1c85be8" class="outline-3">
<h3 id="org1c85be8">Q: How do I install, update, and remove packages?</h3>
<div class="outline-text-3" id="text-org1c85be8">
<p>
Common commands (using apt as example):
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo apt update              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Update package list
</span>sudo apt upgrade             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Upgrade all packages
</span>sudo apt full-upgrade        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Upgrade with dependency resolution
</span>sudo apt install package     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Install package
</span>sudo apt remove package      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove package (keep config)
</span>sudo apt purge package       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove package and config
</span>sudo apt autoremove          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove unused dependencies
</span>sudo apt search keyword      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Search for package
</span>sudo apt show package        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show package information</span>
</pre>
</div>
</div>
</div>
