org/posts/linux-os.org
** Q: What is the difference between update, upgrade, and dist-upgrade?

- ~apt update~ — Refreshes package list (doesn't install anything)
- ~apt upgrade~ — Installs available updates (safe)
- ~apt dist-upgrade~ / ~apt full-upgrade~ — Upgrades with dependency resolution (may remove packages)

** Q: What is a process?

A process is a running instance of a program. Each process has:

- Process ID (PID) — Unique identifier
- Parent Process ID (PPID) — PID of parent process
- Process state (running, sleeping, zombie, etc.)
- Memory usage and allocation
- CPU usage and scheduling information
- File descriptors (open files)
- Environment variables

** Q: What is a background and foreground process?

- *Foreground process* — Runs in foreground, takes terminal input/output, blocks terminal until completion
- *Background process* — Runs in background, doesn't use terminal, allows other commands
  - Start with ~&~: ~command &~
  - Move running to background: Press Ctrl+Z then ~bg~

** Q: How do I view running processes?

Common tools:

#+BEGIN_SRC bash
ps                          # Current shell processes
ps aux                      # All processes detailed
ps -ef                      # All processes in different format
ps -ef --forest             # Process tree
top                         # Real-time process monitor
htop                        # Interactive process viewer
pgrep process_name          # Find PID by name
pidof program_name          # Get PID of program
lsof                        # List open files
#+END_SRC

** Q: What do the columns in ps aux mean?

~ps aux~ output columns:

| Column  | Meaning                            |
|---------+------------------------------------|
| USER    | Process owner                      |
| PID     | Process ID                         |
| %CPU    | CPU usage percentage               |
| %MEM    | Memory usage percentage            |
| VSZ     | Virtual memory size in KB          |
| RSS     | Resident set size (physical) in KB |
| TTY     | Terminal (? = no terminal)         |
| STAT    | Process state                      |
| START   | Start time                         |
| TIME    | CPU time used                      |
| COMMAND | Command line                       |

** Q: How do I stop or kill a process?

Use the ~kill~ command with different signals:

#+BEGIN_SRC bash
kill PID                    # Terminate gracefully (SIGTERM=15)
kill -9 PID                 # Force kill (SIGKILL=9)
kill -STOP PID              # Pause process
kill -CONT PID              # Resume process
killall process_name        # Kill by name
pkill pattern               # Kill by pattern
#+END_SRC

Signal reference:
- 1 (HUP) — Hang up
- 2 (INT) — Interrupt (Ctrl+C)
- 9 (KILL) — Force kill
- 15 (TERM) — Terminate (default)
- 19 (STOP) — Stop
- 18 (CONT) — Continue

** Q: What are the different process states?

Process states visible in ~ps~ output:

| State | Meaning                          |
|-------|----------------------------------|
| R     | Running                          |
| S     | Sleeping (interruptible)         |
| D     | Disk sleep (uninterruptible)     |
| Z     | Zombie                           |
| T     | Stopped                          |
| W     | Paging                           |
| X     | Dead                             |

** Q: What is a zombie process?

A zombie (defunct) process is a process that has terminated but whose parent hasn't called ~wait()~ to collect its status.

Characteristics:
- Appears in ~ps~ output with ~<defunct>~ label
- No resources consumed except PID table entry
- Cannot be killed with normal signals

Solutions:
- Wait for parent to call wait() and reap zombie
- Kill the parent process (parent's death causes init to reap)

** Q: What is a daemon?

A daemon is a background process that runs continuously, typically without a controlling terminal. Characteristics:

- Runs in background continuously
- No standard input/output
- Often started at boot
- Performs system or network tasks
- Named with 'd' suffix (sshd, httpd, mysqld, etc.)

Common daemons:
- ~sshd~ — SSH server
- ~httpd~ / ~nginx~ — Web server
- ~mysqld~ — MySQL database
- ~cron~ — Task scheduler
- ~syslog~ — System logging

** Q: How do I check system information?

Useful commands:

#+BEGIN_SRC bash
uname -a                    # Complete system information
uname -r                    # Kernel version
hostnamectl                 # Hostname and OS info
lsb_release -a              # Linux release information
cat /etc/os-release         # OS details
cat /proc/version           # Kernel and compiler info
#+END_SRC

