public/posts/linux-os.html
<div id="outline-container-org9f9c829" class="outline-3">
<h3 id="org9f9c829">Q: What is the difference between update, upgrade, and dist-upgrade?</h3>
<div class="outline-text-3" id="text-org9f9c829">
<ul class="org-ul">
<li><code>apt update</code> — Refreshes package list (doesn't install anything)</li>
<li><code>apt upgrade</code> — Installs available updates (safe)</li>
<li><code>apt dist-upgrade</code> / <code>apt full-upgrade</code> — Upgrades with dependency resolution (may remove packages)</li>
</ul>
</div>
</div>
<div id="outline-container-org407f864" class="outline-3">
<h3 id="org407f864">Q: What is a process?</h3>
<div class="outline-text-3" id="text-org407f864">
<p>
A process is a running instance of a program. Each process has:
</p>

<ul class="org-ul">
<li>Process ID (PID) — Unique identifier</li>
<li>Parent Process ID (PPID) — PID of parent process</li>
<li>Process state (running, sleeping, zombie, etc.)</li>
<li>Memory usage and allocation</li>
<li>CPU usage and scheduling information</li>
<li>File descriptors (open files)</li>
<li>Environment variables</li>
</ul>
</div>
</div>
<div id="outline-container-org86afe5d" class="outline-3">
<h3 id="org86afe5d">Q: What is a background and foreground process?</h3>
<div class="outline-text-3" id="text-org86afe5d">
<ul class="org-ul">
<li><b>Foreground process</b> — Runs in foreground, takes terminal input/output, blocks terminal until completion</li>
<li><b>Background process</b> — Runs in background, doesn't use terminal, allows other commands
<ul class="org-ul">
<li>Start with <code>&amp;</code>: <code>command &amp;</code></li>
<li>Move running to background: Press Ctrl+Z then <code>bg</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org4f8fb82" class="outline-3">
<h3 id="org4f8fb82">Q: How do I view running processes?</h3>
<div class="outline-text-3" id="text-org4f8fb82">
<p>
Common tools:
</p>

<div class="org-src-container">
<pre class="src src-bash">ps                          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Current shell processes
</span>ps aux                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">All processes detailed
</span>ps -ef                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">All processes in different format
</span>ps -ef --forest             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Process tree
</span>top                         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Real-time process monitor
</span>htop                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Interactive process viewer
</span>pgrep process_name          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Find PID by name
</span>pidof program_name          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Get PID of program
</span>lsof                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List open files</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6f03f6d" class="outline-3">
<h3 id="org6f03f6d">Q: What do the columns in ps aux mean?</h3>
<div class="outline-text-3" id="text-org6f03f6d">
<p>
<code>ps aux</code> output columns:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Column</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">USER</td>
<td class="org-left">Process owner</td>
</tr>

<tr>
<td class="org-left">PID</td>
<td class="org-left">Process ID</td>
</tr>

<tr>
<td class="org-left">%CPU</td>
<td class="org-left">CPU usage percentage</td>
</tr>

<tr>
<td class="org-left">%MEM</td>
<td class="org-left">Memory usage percentage</td>
</tr>

<tr>
<td class="org-left">VSZ</td>
<td class="org-left">Virtual memory size in KB</td>
</tr>

<tr>
<td class="org-left">RSS</td>
<td class="org-left">Resident set size (physical) in KB</td>
</tr>

<tr>
<td class="org-left">TTY</td>
<td class="org-left">Terminal (? = no terminal)</td>
</tr>

<tr>
<td class="org-left">STAT</td>
<td class="org-left">Process state</td>
</tr>

<tr>
<td class="org-left">START</td>
<td class="org-left">Start time</td>
</tr>

<tr>
<td class="org-left">TIME</td>
<td class="org-left">CPU time used</td>
</tr>

<tr>
<td class="org-left">COMMAND</td>
<td class="org-left">Command line</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb8cbed9" class="outline-3">
<h3 id="orgb8cbed9">Q: How do I stop or kill a process?</h3>
<div class="outline-text-3" id="text-orgb8cbed9">
<p>
Use the <code>kill</code> command with different signals:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">kill</span> PID                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Terminate gracefully (SIGTERM=15)
</span><span style="font-weight: bold;">kill</span> -9 PID                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Force kill (SIGKILL=9)
</span><span style="font-weight: bold;">kill</span> -STOP PID              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Pause process
</span><span style="font-weight: bold;">kill</span> -CONT PID              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Resume process
</span>killall process_name        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Kill by name
</span>pkill pattern               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Kill by pattern</span>
</pre>
</div>

<p>
Signal reference:
</p>
<ul class="org-ul">
<li>1 (HUP) — Hang up</li>
<li>2 (INT) — Interrupt (Ctrl+C)</li>
<li>9 (KILL) — Force kill</li>
<li>15 (TERM) — Terminate (default)</li>
<li>19 (STOP) — Stop</li>
<li>18 (CONT) — Continue</li>
</ul>
</div>
</div>
<div id="outline-container-org52b17c0" class="outline-3">
<h3 id="org52b17c0">Q: What are the different process states?</h3>
<div class="outline-text-3" id="text-org52b17c0">
<p>
Process states visible in <code>ps</code> output:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">State</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">R</td>
<td class="org-left">Running</td>
</tr>

<tr>
<td class="org-left">S</td>
<td class="org-left">Sleeping (interruptible)</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">Disk sleep (uninterruptible)</td>
</tr>

<tr>
<td class="org-left">Z</td>
<td class="org-left">Zombie</td>
</tr>

<tr>
<td class="org-left">T</td>
<td class="org-left">Stopped</td>
</tr>

<tr>
<td class="org-left">W</td>
<td class="org-left">Paging</td>
</tr>

<tr>
<td class="org-left">X</td>
<td class="org-left">Dead</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8cb7359" class="outline-3">
<h3 id="org8cb7359">Q: What is a zombie process?</h3>
<div class="outline-text-3" id="text-org8cb7359">
<p>
A zombie (defunct) process is a process that has terminated but whose parent hasn't called <code>wait()</code> to collect its status.
</p>

<p>
Characteristics:
</p>
<ul class="org-ul">
<li>Appears in <code>ps</code> output with <code>&lt;defunct&gt;</code> label</li>
<li>No resources consumed except PID table entry</li>
<li>Cannot be killed with normal signals</li>
</ul>

<p>
Solutions:
</p>
<ul class="org-ul">
<li>Wait for parent to call wait() and reap zombie</li>
<li>Kill the parent process (parent's death causes init to reap)</li>
</ul>
</div>
</div>
<div id="outline-container-org5430a76" class="outline-3">
<h3 id="org5430a76">Q: What is a daemon?</h3>
<div class="outline-text-3" id="text-org5430a76">
<p>
A daemon is a background process that runs continuously, typically without a controlling terminal. Characteristics:
</p>

<ul class="org-ul">
<li>Runs in background continuously</li>
<li>No standard input/output</li>
<li>Often started at boot</li>
<li>Performs system or network tasks</li>
<li>Named with 'd' suffix (sshd, httpd, mysqld, etc.)</li>
</ul>

<p>
Common daemons:
</p>
<ul class="org-ul">
<li><code>sshd</code> — SSH server</li>
<li><code>httpd</code> / <code>nginx</code> — Web server</li>
<li><code>mysqld</code> — MySQL database</li>
<li><code>cron</code> — Task scheduler</li>
<li><code>syslog</code> — System logging</li>
</ul>
</div>
</div>
<div id="outline-container-orge8eba4c" class="outline-3">
<h3 id="orge8eba4c">Q: How do I check system information?</h3>
<div class="outline-text-3" id="text-orge8eba4c">
<p>
Useful commands:
</p>

<div class="org-src-container">
<pre class="src src-bash">uname -a                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Complete system information
</span>uname -r                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Kernel version
</span>hostnamectl                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Hostname and OS info
</span>lsb_release -a              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Linux release information
</span>cat /etc/os-release         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">OS details
</span>cat /proc/version           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Kernel and compiler info</span>
</pre>
</div>
</div>
</div>
