org/posts/linux-os.org
** Q: How do I check CPU information?

#+BEGIN_SRC bash
lscpu                       # CPU architecture and model
cat /proc/cpuinfo           # Detailed per-core CPU info
nproc                       # Number of processors
top -n 1 | head -n 20       # CPU usage
#+END_SRC

** Q: How do I check memory usage?

#+BEGIN_SRC bash
free -h                     # Memory summary (human-readable)
free -m                     # In megabytes
cat /proc/meminfo           # Detailed memory information
vmstat                      # Virtual memory statistics
top                         # Real-time memory monitoring
ps aux                      # Per-process memory usage
#+END_SRC

Memory types:
- =total~ — Total installed RAM
- =used~ — Currently used
- =free~ — Not currently used
- =available~ — Can be allocated to processes
- =buffers~ — Cache for file system buffers
- =cached~ — Page cache
- =swap~ — Disk-based virtual memory

** Q: How do I check disk usage?

#+BEGIN_SRC bash
df -h                       # Filesystem usage (human-readable)
df -i                       # Inode usage
du -sh *                    # Size of items in current directory
du -h directory/            # Recursive size
lsblk                       # Block devices
fdisk -l                    # Partition table
parted -l                   # Partition information
#+END_SRC

Columns in ~df -h~:
- =Filesystem~ — Device name
- =Size~ — Total size
- =Used~ — Used space
- =Avail~ — Available space
- =Use%~ — Usage percentage
- =Mounted on~ — Mount point

** Q: How do I check system uptime and load average?

#+BEGIN_SRC bash
uptime                      # System uptime and load average
cat /proc/uptime            # Uptime in seconds
systemd-analyze             # Boot time analysis
#+END_SRC

Load average (in uptime output):
- 1-minute average
- 5-minute average
- 15-minute average

On single-core: load 1.0 = 100% CPU utilization
On quad-core: load 4.0 = 100% CPU utilization

** Q: How do I check network configuration?

Common commands:

#+BEGIN_SRC bash
ip addr show                # IP addresses (modern)
ifconfig                    # Network interfaces (older)
ip route show               # Routing table
route -n                    # Routing table (alternative)
ip link show                # Network interfaces info
#+END_SRC

** Q: How do I test network connectivity?

#+BEGIN_SRC bash
ping host                   # Test ICMP connectivity
ping -c 3 host              # Ping 3 times
traceroute host             # Trace route to destination
mtr host                    # Real-time network diagnostics
telnet host port            # Test TCP connection
nc -zv host port            # Test port connectivity
#+END_SRC

** Q: How do I perform DNS lookups?

#+BEGIN_SRC bash
nslookup domain             # DNS lookup
dig domain                  # Detailed DNS info
host domain                 # Quick DNS lookup
getent hosts domain         # Check /etc/hosts and DNS
cat /etc/resolv.conf        # DNS servers configuration
#+END_SRC

** Q: How do I check network statistics and connections?

#+BEGIN_SRC bash
netstat -an                 # All connections (deprecated)
ss -an                      # Socket statistics (modern)
ss -tlnp                    # Listening TCP ports with programs
ss -ulnp                    # Listening UDP ports with programs
netstat -i                  # Network interfaces stats
netstat -r                  # Routing table
#+END_SRC

** Q: How do I download files from the internet?

#+BEGIN_SRC bash
wget url                    # Download file
wget -O filename url        # Download with custom name
wget -q url                 # Quiet mode
wget -r url                 # Recursive download
curl url                    # Display content
curl -O url                 # Download and save
curl -o filename url        # Download with custom name
curl -L url                 # Follow redirects
#+END_SRC

