public/posts/linux-os.html
<div id="outline-container-org5a97d9e" class="outline-3">
<h3 id="org5a97d9e">Q: How do I check CPU information?</h3>
<div class="outline-text-3" id="text-org5a97d9e">
<div class="org-src-container">
<pre class="src src-bash">lscpu                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">CPU architecture and model
</span>cat /proc/cpuinfo           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Detailed per-core CPU info
</span>nproc                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Number of processors
</span>top -n 1 | head -n 20       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">CPU usage</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org02e83f0" class="outline-3">
<h3 id="org02e83f0">Q: How do I check memory usage?</h3>
<div class="outline-text-3" id="text-org02e83f0">
<div class="org-src-container">
<pre class="src src-bash">free -h                     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Memory summary (human-readable)
</span>free -m                     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">In megabytes
</span>cat /proc/meminfo           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Detailed memory information
</span>vmstat                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Virtual memory statistics
</span>top                         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Real-time memory monitoring
</span>ps aux                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Per-process memory usage</span>
</pre>
</div>

<p>
Memory types:
</p>
<ul class="org-ul">
<li><code>total</code> — Total installed RAM</li>
<li><code>used</code> — Currently used</li>
<li><code>free</code> — Not currently used</li>
<li><code>available</code> — Can be allocated to processes</li>
<li><code>buffers</code> — Cache for file system buffers</li>
<li><code>cached</code> — Page cache</li>
<li><code>swap</code> — Disk-based virtual memory</li>
</ul>
</div>
</div>
<div id="outline-container-orgac2fec0" class="outline-3">
<h3 id="orgac2fec0">Q: How do I check disk usage?</h3>
<div class="outline-text-3" id="text-orgac2fec0">
<div class="org-src-container">
<pre class="src src-bash">df -h                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Filesystem usage (human-readable)
</span>df -i                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Inode usage
</span>du -sh *                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Size of items in current directory
</span>du -h directory/            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Recursive size
</span>lsblk                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Block devices
</span>fdisk -l                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Partition table
</span>parted -l                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Partition information</span>
</pre>
</div>

<p>
Columns in <code>df -h</code>:
</p>
<ul class="org-ul">
<li><code>Filesystem</code> — Device name</li>
<li><code>Size</code> — Total size</li>
<li><code>Used</code> — Used space</li>
<li><code>Avail</code> — Available space</li>
<li><code>Use%</code> — Usage percentage</li>
<li><code>Mounted on</code> — Mount point</li>
</ul>
</div>
</div>
<div id="outline-container-orgbbbded7" class="outline-3">
<h3 id="orgbbbded7">Q: How do I check system uptime and load average?</h3>
<div class="outline-text-3" id="text-orgbbbded7">
<div class="org-src-container">
<pre class="src src-bash">uptime                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">System uptime and load average
</span>cat /proc/uptime            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Uptime in seconds
</span>systemd-analyze             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Boot time analysis</span>
</pre>
</div>

<p>
Load average (in uptime output):
</p>
<ul class="org-ul">
<li>1-minute average</li>
<li>5-minute average</li>
<li>15-minute average</li>
</ul>

<p>
On single-core: load 1.0 = 100% CPU utilization
On quad-core: load 4.0 = 100% CPU utilization
</p>
</div>
</div>
<div id="outline-container-orgdec632a" class="outline-3">
<h3 id="orgdec632a">Q: How do I check network configuration?</h3>
<div class="outline-text-3" id="text-orgdec632a">
<p>
Common commands:
</p>

<div class="org-src-container">
<pre class="src src-bash">ip addr show                <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">IP addresses (modern)
</span>ifconfig                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Network interfaces (older)
</span>ip route show               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Routing table
</span>route -n                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Routing table (alternative)
</span>ip link show                <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Network interfaces info</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2c80af5" class="outline-3">
<h3 id="org2c80af5">Q: How do I test network connectivity?</h3>
<div class="outline-text-3" id="text-org2c80af5">
<div class="org-src-container">
<pre class="src src-bash">ping host                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Test ICMP connectivity
</span>ping -c 3 host              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Ping 3 times
</span>traceroute host             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Trace route to destination
</span>mtr host                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Real-time network diagnostics
</span>telnet host port            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Test TCP connection
</span>nc -zv host port            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Test port connectivity</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0c3cdc2" class="outline-3">
<h3 id="org0c3cdc2">Q: How do I perform DNS lookups?</h3>
<div class="outline-text-3" id="text-org0c3cdc2">
<div class="org-src-container">
<pre class="src src-bash">nslookup domain             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">DNS lookup
</span>dig domain                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Detailed DNS info
</span>host domain                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Quick DNS lookup
</span>getent hosts domain         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Check /etc/hosts and DNS
</span>cat /etc/resolv.conf        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">DNS servers configuration</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org9080b1b" class="outline-3">
<h3 id="org9080b1b">Q: How do I check network statistics and connections?</h3>
<div class="outline-text-3" id="text-org9080b1b">
<div class="org-src-container">
<pre class="src src-bash">netstat -an                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">All connections (deprecated)
</span>ss -an                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Socket statistics (modern)
</span>ss -tlnp                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Listening TCP ports with programs
</span>ss -ulnp                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Listening UDP ports with programs
</span>netstat -i                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Network interfaces stats
</span>netstat -r                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Routing table</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org500b5c1" class="outline-3">
<h3 id="org500b5c1">Q: How do I download files from the internet?</h3>
<div class="outline-text-3" id="text-org500b5c1">
<div class="org-src-container">
<pre class="src src-bash">wget url                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Download file
</span>wget -O filename url        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Download with custom name
</span>wget -q url                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Quiet mode
</span>wget -r url                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Recursive download
</span>curl url                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Display content
</span>curl -O url                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Download and save
</span>curl -o filename url        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Download with custom name
</span>curl -L url                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Follow redirects</span>
</pre>
</div>
</div>
</div>
