org/posts/linux-os.org
** Q: How do I use grep effectively?

#+BEGIN_SRC bash
grep "pattern" file.txt             # Search for pattern
grep -i "pattern" file.txt          # Case-insensitive
grep -r "pattern" directory/        # Recursive search
grep -n "pattern" file.txt          # Show line numbers
grep -E "regex" file.txt            # Extended regex
grep -v "pattern" file.txt          # Invert match
grep -c "pattern" file.txt          # Count matches
grep -l "pattern" *.txt             # List files with matches
grep -A 3 "pattern" file.txt        # Show 3 lines after match
grep -B 2 "pattern" file.txt        # Show 2 lines before match
grep -C 2 "pattern" file.txt        # Show 2 lines context
#+END_SRC

** Q: What is piping and how do I use it?

Piping connects command output to another command's input using ~|~:

#+BEGIN_SRC bash
cat file.txt | grep "keyword"       # Filter file contents
cat file.txt | grep "keyword" | wc -l  # Count matches
ls -l | sort -k5 -rn               # List and sort by size
ps aux | grep process_name         # Find process
cat /var/log/syslog | tail -20     # Last 20 log lines
#+END_SRC

Related operators:
- ~>~ — Redirect output to file (overwrite)
- ~>>~ — Append output to file
- ~<~ — Redirect input from file
- ~2>~ — Redirect error output
- ~&>~ — Redirect both output and error

** Q: How do I work with file input/output redirection?

Redirection operators:

#+BEGIN_SRC bash
command > file.txt              # Write to file (overwrite)
command >> file.txt             # Append to file
command < input.txt             # Read from file
command > output.txt 2>&1       # Redirect output and error
command 2> error.txt            # Redirect errors only
command 2> /dev/null            # Discard errors
cmd1 | cmd2                      # Pipe output to command
cmd1 | tee file.txt | cmd2       # Tee: output to file and command
#+END_SRC

File descriptors:
- 0 — stdin (standard input)
- 1 — stdout (standard output)
- 2 — stderr (standard error)

** Q: What are important configuration files?

Key system configuration files:

#+BEGIN_SRC
/etc/hostname               # System hostname
/etc/hosts                  # Hostname to IP mapping
/etc/fstab                  # Filesystem mount configuration
/etc/sudoers                # sudo permissions
/etc/ssh/sshd_config        # SSH server configuration
/etc/sysctl.conf            # Kernel parameters
/etc/environment            # Global environment variables
/etc/profile                # Login shell initialization
/etc/bashrc                 # Interactive shell initialization
/etc/crontab                # System-wide cron jobs
#+END_SRC

** Q: What is /etc/fstab and how do I configure it?

File system table (=/etc/fstab~) defines which filesystems are mounted at boot:

#+BEGIN_SRC
/dev/sda1       /           ext4    defaults            0 1
/dev/sda2       /boot       ext4    defaults            0 2
/dev/sda3       swap        swap    defaults            0 0
192.168.1.1:/nfs /mnt/nfs   nfs     defaults            0 0
#+END_SRC

Fields:
- Device/UUID — Filesystem location
- Mount point — Where to mount
- Filesystem type — ext4, xfs, nfs, swap, etc.
- Mount options — defaults, ro, noatime, etc.
- Dump flag — 0=don't backup, 1=backup
- Pass number — fsck order (0=skip, 1=root, 2=other)

** Q: How do I mount and unmount filesystems?

#+BEGIN_SRC bash
mount device mount_point            # Mount filesystem
mount -t type device mount_point    # Mount with type
mount -o remount,ro /               # Remount as read-only
mount -o bind /src /dest            # Bind mount
umount mount_point                  # Unmount
umount -l mount_point               # Lazy unmount
umount -f mount_point               # Force unmount
mount | grep ext4                   # Show mounted ext4 filesystems
#+END_SRC

** Q: What is the boot process in Linux?

Boot sequence:

1. *BIOS/UEFI* — Hardware initialization and self-test
2. *Bootloader (GRUB/LILO)* — Loads kernel and initrd/initramfs
3. *Kernel initialization* — Kernel decompresses and starts
4. *Early userspace* — initrd/initramfs mounts root filesystem
5. *init/systemd (PID 1)* — First user-space process, starts services
6. *Runlevel/target* — System reaches multi-user or graphical target
7. *Login services* — Display login prompt

View boot process:

#+BEGIN_SRC bash
dmesg | head -50                    # Kernel messages
journalctl -b                       # Current boot messages
systemd-analyze                     # Boot time analysis
#+END_SRC

