public/posts/linux-os.html
<div id="outline-container-orgee133b4" class="outline-3">
<h3 id="orgee133b4">Q: How do I use grep effectively?</h3>
<div class="outline-text-3" id="text-orgee133b4">
<div class="org-src-container">
<pre class="src src-bash">grep <span style="font-style: italic;">"pattern"</span> file.txt             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Search for pattern
</span>grep -i <span style="font-style: italic;">"pattern"</span> file.txt          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Case-insensitive
</span>grep -r <span style="font-style: italic;">"pattern"</span> directory/        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Recursive search
</span>grep -n <span style="font-style: italic;">"pattern"</span> file.txt          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show line numbers
</span>grep -E <span style="font-style: italic;">"regex"</span> file.txt            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Extended regex
</span>grep -v <span style="font-style: italic;">"pattern"</span> file.txt          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Invert match
</span>grep -c <span style="font-style: italic;">"pattern"</span> file.txt          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Count matches
</span>grep -l <span style="font-style: italic;">"pattern"</span> *.txt             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List files with matches
</span>grep -A 3 <span style="font-style: italic;">"pattern"</span> file.txt        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show 3 lines after match
</span>grep -B 2 <span style="font-style: italic;">"pattern"</span> file.txt        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show 2 lines before match
</span>grep -C 2 <span style="font-style: italic;">"pattern"</span> file.txt        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show 2 lines context</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbb710da" class="outline-3">
<h3 id="orgbb710da">Q: What is piping and how do I use it?</h3>
<div class="outline-text-3" id="text-orgbb710da">
<p>
Piping connects command output to another command's input using <code>|</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">cat file.txt | grep <span style="font-style: italic;">"keyword"</span>       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Filter file contents
</span>cat file.txt | grep <span style="font-style: italic;">"keyword"</span> | wc -l  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Count matches
</span>ls -l | sort -k5 -rn               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List and sort by size
</span>ps aux | grep process_name         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Find process
</span>cat /var/log/syslog | tail -20     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Last 20 log lines</span>
</pre>
</div>

<p>
Related operators:
</p>
<ul class="org-ul">
<li><code>&gt;</code> — Redirect output to file (overwrite)</li>
<li><code>&gt;&gt;</code> — Append output to file</li>
<li><code>&lt;</code> — Redirect input from file</li>
<li><code>2&gt;</code> — Redirect error output</li>
<li><code>&amp;&gt;</code> — Redirect both output and error</li>
</ul>
</div>
</div>
<div id="outline-container-org55856f6" class="outline-3">
<h3 id="org55856f6">Q: How do I work with file input/output redirection?</h3>
<div class="outline-text-3" id="text-org55856f6">
<p>
Redirection operators:
</p>

<div class="org-src-container">
<pre class="src src-bash">command &gt; file.txt              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Write to file (overwrite)
</span>command &gt;&gt; file.txt             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Append to file
</span>command &lt; input.txt             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Read from file
</span>command &gt; output.txt 2&gt;&amp;1       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Redirect output and error
</span>command 2&gt; error.txt            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Redirect errors only
</span>command 2&gt; /dev/null            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Discard errors
</span>cmd1 | cmd2                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Pipe output to command
</span>cmd1 | tee file.txt | cmd2       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Tee: output to file and command</span>
</pre>
</div>

<p>
File descriptors:
</p>
<ul class="org-ul">
<li>0 — stdin (standard input)</li>
<li>1 — stdout (standard output)</li>
<li>2 — stderr (standard error)</li>
</ul>
</div>
</div>
<div id="outline-container-orge889d79" class="outline-3">
<h3 id="orge889d79">Q: What are important configuration files?</h3>
<div class="outline-text-3" id="text-orge889d79">
<p>
Key system configuration files:
</p>

<div class="org-src-container">
<pre class="src src-nil">/etc/hostname               # System hostname
/etc/hosts                  # Hostname to IP mapping
/etc/fstab                  # Filesystem mount configuration
/etc/sudoers                # sudo permissions
/etc/ssh/sshd_config        # SSH server configuration
/etc/sysctl.conf            # Kernel parameters
/etc/environment            # Global environment variables
/etc/profile                # Login shell initialization
/etc/bashrc                 # Interactive shell initialization
/etc/crontab                # System-wide cron jobs
</pre>
</div>
</div>
</div>
<div id="outline-container-org48f421f" class="outline-3">
<h3 id="org48f421f">Q: What is /etc/fstab and how do I configure it?</h3>
<div class="outline-text-3" id="text-org48f421f">
<p>
File system table (<code>/etc/fstab</code>) defines which filesystems are mounted at boot:
</p>

<div class="org-src-container">
<pre class="src src-nil">/dev/sda1       /           ext4    defaults            0 1
/dev/sda2       /boot       ext4    defaults            0 2
/dev/sda3       swap        swap    defaults            0 0
192.168.1.1:/nfs /mnt/nfs   nfs     defaults            0 0
</pre>
</div>

<p>
Fields:
</p>
<ul class="org-ul">
<li>Device/UUID — Filesystem location</li>
<li>Mount point — Where to mount</li>
<li>Filesystem type — ext4, xfs, nfs, swap, etc.</li>
<li>Mount options — defaults, ro, noatime, etc.</li>
<li>Dump flag — 0=don't backup, 1=backup</li>
<li>Pass number — fsck order (0=skip, 1=root, 2=other)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc9879e8" class="outline-3">
<h3 id="orgc9879e8">Q: How do I mount and unmount filesystems?</h3>
<div class="outline-text-3" id="text-orgc9879e8">
<div class="org-src-container">
<pre class="src src-bash">mount device mount_point            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Mount filesystem
</span>mount -t type device mount_point    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Mount with type
</span>mount -o remount,ro /               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remount as read-only
</span>mount -o bind /src /dest            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Bind mount
</span>umount mount_point                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Unmount
</span>umount -l mount_point               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Lazy unmount
</span>umount -f mount_point               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Force unmount
</span>mount | grep ext4                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show mounted ext4 filesystems</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge0cef3b" class="outline-3">
<h3 id="orge0cef3b">Q: What is the boot process in Linux?</h3>
<div class="outline-text-3" id="text-orge0cef3b">
<p>
Boot sequence:
</p>

<ol class="org-ol">
<li><b>BIOS/UEFI</b> — Hardware initialization and self-test</li>
<li><b>Bootloader (GRUB/LILO)</b> — Loads kernel and initrd/initramfs</li>
<li><b>Kernel initialization</b> — Kernel decompresses and starts</li>
<li><b>Early userspace</b> — initrd/initramfs mounts root filesystem</li>
<li><b>init/systemd (PID 1)</b> — First user-space process, starts services</li>
<li><b>Runlevel/target</b> — System reaches multi-user or graphical target</li>
<li><b>Login services</b> — Display login prompt</li>
</ol>

<p>
View boot process:
</p>

<div class="org-src-container">
<pre class="src src-bash">dmesg | head -50                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Kernel messages
</span>journalctl -b                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Current boot messages
</span>systemd-analyze                     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Boot time analysis</span>
</pre>
</div>
</div>
</div>
