org/posts/linux-os.org
** Q: What is GRUB and how do I edit it?

GRUB (GRand Unified Bootloader) is the bootloader. Configuration:

#+BEGIN_SRC bash
sudo grub-mkconfig -o /boot/grub/grub.cfg  # Generate config
#+END_SRC

Edit in:
- =/etc/default/grub~ — Main config file
- =/etc/grub.d/~ — Configuration scripts

Common parameters in /etc/default/grub:
- ~GRUB_DEFAULT=0~ — Default menu entry
- ~GRUB_TIMEOUT=5~ — Timeout in seconds
- ~GRUB_CMDLINE_LINUX="quiet splash"~ — Kernel arguments

Changes require regenerating config with ~grub-mkconfig~.

-----

* Advanced

** Q: How do I use nice and renice?

Process scheduling and priority control:

- Nice values range from -20 (highest priority) to +19 (lowest priority)
- Default nice value: 0
- Each increment reduces CPU priority

#+BEGIN_SRC bash
nice -n 10 program              # Start with nice 10 (lower priority)
renice -n 5 -p PID              # Change running process
renice -n -5 -p PID             # Increase priority (needs privileges)
ps aux | grep program           # View NI column for nice value
#+END_SRC

** Q: What are system limits and how do I configure them?

System limits in =/etc/security/limits.conf~:

#+BEGIN_SRC
username soft nofile 1024       # Max open files
username hard nofile 2048
@groupname soft nproc 100       # Max processes
@groupname hard nproc 200
#+END_SRC

Check limits:

#+BEGIN_SRC bash
ulimit -a                       # Show all limits
ulimit -n                       # Max open files
ulimit -u                       # Max user processes
ulimit -m                       # Max memory
ulimit -c                       # Core dump size
#+END_SRC

Set limits for current session:

#+BEGIN_SRC bash
ulimit -n 4096                  # Set max open files
ulimit -u 256                   # Set max processes
#+END_SRC

** Q: How do I configure static IP address?

Using Netplan (Ubuntu 18+):

#+BEGIN_SRC yaml
# /etc/netplan/01-netcfg.yaml
network:
  version: 2
  ethernets:
    eth0:
      dhcp4: false
      addresses:
        - 192.168.1.100/24
      gateway4: 192.168.1.1
      nameservers:
        addresses: [8.8.8.8, 8.8.4.4]
#+END_SRC

Apply: ~sudo netplan apply~

** Q: How do I set up firewalls?

UFW (Uncomplicated Firewall):

#+BEGIN_SRC bash
ufw enable
ufw allow 22/tcp         # Allow SSH
ufw allow 80/tcp         # Allow HTTP
ufw deny 23/tcp          # Deny Telnet
ufw status
#+END_SRC

iptables (lower level):

#+BEGIN_SRC bash
iptables -A INPUT -p tcp --dport 22 -j ACCEPT
iptables -P INPUT DROP
iptables-save > /etc/iptables/rules.v4
#+END_SRC

** Q: How do I troubleshoot network issues?

Diagnostic tools:

#+BEGIN_SRC bash
ping host                       # Test ICMP connectivity
traceroute host                 # Trace route to destination
mtr host                        # Real-time network diagnostics
netstat -an | grep ESTABLISHED  # Show established connections
ss -tlnp                        # Show listening ports
tcpdump -i eth0 -n              # Capture packets
nmap host                       # Port scanning
#+END_SRC

** Q: What is umask and how do I use it?

Umask determines default permissions for new files and directories:

- Default: ~0022~ = rw-r--r-- (644) for files, rwxr-xr-x (755) for directories
- Set: ~umask 0077~ for more restrictive permissions

Calculation:
- Files: 0666 (max permissions) - umask
- Directories: 0777 - umask

Example: 0666 - 0022 = 0644 (rw-r--r--)

Set umask:

#+BEGIN_SRC bash
umask 0077                      # Current session
echo "umask 0077" >> ~/.bashrc  # Permanent
#+END_SRC

** Q: What is setuid, setgid, and sticky bit?

Special permissions on files and directories:

*setuid (Set User ID)* — Runs as file owner:

#+BEGIN_SRC bash
chmod u+s program               # Add setuid
chmod 4755 program              # Numeric form
#+END_SRC

Shows as =s= in owner execute position: ~rwsr-xr-x~

*setgid (Set Group ID)* — Runs as group owner:

#+BEGIN_SRC bash
chmod g+s program
chmod 2755 program
#+END_SRC

Shows as =s= in group execute position: ~rwxr-sr-x~

*Sticky bit* — Only owner can delete files:

#+BEGIN_SRC bash
chmod +t directory
chmod 1777 directory
#+END_SRC

Shows as =t= in others execute position: ~rwxrwxrwt~ (like /tmp)

