public/posts/linux-os.html
<div id="outline-container-org7423220" class="outline-3">
<h3 id="org7423220">Q: What is GRUB and how do I edit it?</h3>
<div class="outline-text-3" id="text-org7423220">
<p>
GRUB (GRand Unified Bootloader) is the bootloader. Configuration:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo grub-mkconfig -o /boot/grub/grub.cfg  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Generate config</span>
</pre>
</div>

<p>
Edit in:
</p>
<ul class="org-ul">
<li><code>/etc/default/grub</code> — Main config file</li>
<li><code>/etc/grub.d/</code> — Configuration scripts</li>
</ul>

<p>
Common parameters in /etc/default/grub:
</p>
<ul class="org-ul">
<li><code>GRUB_DEFAULT=0</code> — Default menu entry</li>
<li><code>GRUB_TIMEOUT=5</code> — Timeout in seconds</li>
<li><code>GRUB_CMDLINE_LINUX="quiet splash"</code> — Kernel arguments</li>
</ul>

<p>
Changes require regenerating config with <code>grub-mkconfig</code>.
</p>

<hr>
</div>
</div>
</div>
<div id="outline-container-org9da5fda" class="outline-2">
<h2 id="org9da5fda">Advanced</h2>
<div class="outline-text-2" id="text-org9da5fda">
</div>
<div id="outline-container-orgc7290c9" class="outline-3">
<h3 id="orgc7290c9">Q: How do I use nice and renice?</h3>
<div class="outline-text-3" id="text-orgc7290c9">
<p>
Process scheduling and priority control:
</p>

<ul class="org-ul">
<li>Nice values range from -20 (highest priority) to +19 (lowest priority)</li>
<li>Default nice value: 0</li>
<li>Each increment reduces CPU priority</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">nice -n 10 program              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Start with nice 10 (lower priority)
</span>renice -n 5 -p PID              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change running process
</span>renice -n -5 -p PID             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Increase priority (needs privileges)
</span>ps aux | grep program           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">View NI column for nice value</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgca2d340" class="outline-3">
<h3 id="orgca2d340">Q: What are system limits and how do I configure them?</h3>
<div class="outline-text-3" id="text-orgca2d340">
<p>
System limits in <code>/etc/security/limits.conf</code>:
</p>

<div class="org-src-container">
<pre class="src src-nil">username soft nofile 1024       # Max open files
username hard nofile 2048
@groupname soft nproc 100       # Max processes
@groupname hard nproc 200
</pre>
</div>

<p>
Check limits:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">ulimit</span> -a                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show all limits
</span><span style="font-weight: bold;">ulimit</span> -n                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Max open files
</span><span style="font-weight: bold;">ulimit</span> -u                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Max user processes
</span><span style="font-weight: bold;">ulimit</span> -m                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Max memory
</span><span style="font-weight: bold;">ulimit</span> -c                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Core dump size</span>
</pre>
</div>

<p>
Set limits for current session:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">ulimit</span> -n 4096                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set max open files
</span><span style="font-weight: bold;">ulimit</span> -u 256                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set max processes</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4f57d60" class="outline-3">
<h3 id="org4f57d60">Q: How do I configure static IP address?</h3>
<div class="outline-text-3" id="text-org4f57d60">
<p>
Using Netplan (Ubuntu 18+):
</p>

<div class="org-src-container">
<pre class="src src-yaml"># /etc/netplan/01-netcfg.yaml
network:
  version: 2
  ethernets:
    eth0:
      dhcp4: false
      addresses:
        - 192.168.1.100/24
      gateway4: 192.168.1.1
      nameservers:
        addresses: [8.8.8.8, 8.8.4.4]
</pre>
</div>

<p>
Apply: <code>sudo netplan apply</code>
</p>
</div>
</div>
<div id="outline-container-org011722c" class="outline-3">
<h3 id="org011722c">Q: How do I set up firewalls?</h3>
<div class="outline-text-3" id="text-org011722c">
<p>
UFW (Uncomplicated Firewall):
</p>

<div class="org-src-container">
<pre class="src src-bash">ufw enable
ufw allow 22/tcp         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Allow SSH
</span>ufw allow 80/tcp         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Allow HTTP
</span>ufw deny 23/tcp          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Deny Telnet
</span>ufw status
</pre>
</div>

<p>
iptables (lower level):
</p>

<div class="org-src-container">
<pre class="src src-bash">iptables -A INPUT -p tcp --dport 22 -j ACCEPT
iptables -P INPUT DROP
iptables-save &gt; /etc/iptables/rules.v4
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb8cda76" class="outline-3">
<h3 id="orgb8cda76">Q: How do I troubleshoot network issues?</h3>
<div class="outline-text-3" id="text-orgb8cda76">
<p>
Diagnostic tools:
</p>

<div class="org-src-container">
<pre class="src src-bash">ping host                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Test ICMP connectivity
</span>traceroute host                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Trace route to destination
</span>mtr host                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Real-time network diagnostics
</span>netstat -an | grep ESTABLISHED  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show established connections
</span>ss -tlnp                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show listening ports
</span>tcpdump -i eth0 -n              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Capture packets
</span>nmap host                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Port scanning</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgde32569" class="outline-3">
<h3 id="orgde32569">Q: What is umask and how do I use it?</h3>
<div class="outline-text-3" id="text-orgde32569">
<p>
Umask determines default permissions for new files and directories:
</p>

<ul class="org-ul">
<li>Default: <code>0022</code> = rw-r&#x2013;r&#x2013; (644) for files, rwxr-xr-x (755) for directories</li>
<li>Set: <code>umask 0077</code> for more restrictive permissions</li>
</ul>

<p>
Calculation:
</p>
<ul class="org-ul">
<li>Files: 0666 (max permissions) - umask</li>
<li>Directories: 0777 - umask</li>
</ul>

<p>
Example: 0666 - 0022 = 0644 (rw-r&#x2013;r&#x2013;)
</p>

<p>
Set umask:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold;">umask</span> 0077                      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Current session
</span><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"umask 0077"</span> &gt;&gt; ~/.bashrc  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Permanent</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org196c009" class="outline-3">
<h3 id="org196c009">Q: What is setuid, setgid, and sticky bit?</h3>
<div class="outline-text-3" id="text-org196c009">
<p>
Special permissions on files and directories:
</p>

<p>
<b>setuid (Set User ID)</b> — Runs as file owner:
</p>

<div class="org-src-container">
<pre class="src src-bash">chmod u+s program               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add setuid
</span>chmod 4755 program              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Numeric form</span>
</pre>
</div>

<p>
Shows as <code>s</code> in owner execute position: <code>rwsr-xr-x</code>
</p>

<p>
<b>setgid (Set Group ID)</b> — Runs as group owner:
</p>

<div class="org-src-container">
<pre class="src src-bash">chmod g+s program
chmod 2755 program
</pre>
</div>

<p>
Shows as <code>s</code> in group execute position: <code>rwxr-sr-x</code>
</p>

<p>
<b>Sticky bit</b> — Only owner can delete files:
</p>

<div class="org-src-container">
<pre class="src src-bash">chmod +t directory
chmod 1777 directory
</pre>
</div>

<p>
Shows as <code>t</code> in others execute position: <code>rwxrwxrwt</code> (like /tmp)
</p>
</div>
</div>
