org/posts/linux-os.org
** Q: What is Access Control Lists (ACLs)?

ACLs provide more granular permission control than traditional permissions:

#+BEGIN_SRC bash
getfacl file.txt                    # View ACL
setfacl -m u:username:rwx file.txt  # Give user permissions
setfacl -m g:groupname:rx file.txt  # Give group permissions
setfacl -x u:username file.txt      # Remove user ACL
setfacl -b file.txt                 # Remove all ACLs
#+END_SRC

ACL entry format: ~[u|g]:[name]:[permissions]~
- =u~ — User
- =g~ — Group
- No name — Applies to owner/owning group
- Permissions: r=4, w=2, x=1

** Q: What is SELinux and how is it different from standard permissions?

SELinux (Security-Enhanced Linux) provides Mandatory Access Control (MAC):

- Standard permissions: Discretionary (user can change)
- SELinux: Mandatory (enforced by policy)

SELinux context: ~user_u:role_r:type_t:level_s~

States:

- Enforcing — Policies enforced
- Permissive — Violations logged but not enforced
- Disabled — SELinux disabled

Commands:

#+BEGIN_SRC bash
getenforce                          # Get current state
setenforce 0                        # Set permissive
setenforce 1                        # Set enforcing
ls -Z                               # Show SELinux context
ps -Z                               # Process context
chcon -t httpd_sys_content_t file   # Change context
restorecon -v file                  # Restore default context
#+END_SRC

** Q: How do I use sudo effectively and securely?

sudo configuration in =/etc/sudoers~ (edit with ~sudo visudo~):

#+BEGIN_SRC
user1 ALL=(ALL) ALL                 # Full sudo access
user1 ALL=(ALL) NOPASSWD: ALL       # No password required
%wheel ALL=(ALL) ALL                # All group members
user1 ALL=(ALL) /usr/bin/ls         # Only specific command
#+END_SRC

Logging:

#+BEGIN_SRC bash
sudo -l                             # List permitted commands
sudo -i                             # Login as root
sudo -u username command            # Run as specific user
cat /var/log/auth.log | grep sudo   # View sudo usage
#+END_SRC

** Q: What is the Linux kernel and how does it manage resources?

The kernel is the core managing:

- *Process management* — Scheduling, context switching, resource allocation
- *Memory management* — Virtual memory, paging, memory protection
- *I/O management* — Device drivers, interrupts
- *Filesystem* — File operations, permissions, mounting
- *Networking* — Network protocols, packet processing
- *Interrupt handling* — Hardware and software interrupts

Check kernel: ~uname -r~, ~cat /proc/version~

** Q: What are kernel modules and how do I work with them?

Loadable Kernel Modules (LKM) extend kernel without recompiling:

#+BEGIN_SRC bash
lsmod                               # List loaded modules
modinfo module_name                 # Module information
modprobe module_name                # Load with dependencies
modprobe -r module_name             # Remove module
insmod /path/to/module.ko           # Load directly
rmmod module_name                   # Unload directly
#+END_SRC

Locations: =/lib/modules/$(uname -r)/kernel/~

** Q: How do I tune kernel parameters with sysctl?

Kernel parameters in =/proc/sys/~:

#+BEGIN_SRC bash
sysctl -a                           # Show all parameters
sysctl kernel.panic                 # Show specific parameter
sysctl -w kernel.panic=10           # Change parameter
sysctl -p                           # Load from /etc/sysctl.conf
#+END_SRC

Persistent configuration in =/etc/sysctl.conf~:

#+BEGIN_SRC
kernel.panic = 10
net.core.somaxconn = 1024
net.ipv4.tcp_max_syn_backlog = 2048
vm.swappiness = 10
#+END_SRC

Important parameters:
- ~kernel.panic~ — Seconds before reboot on panic
- ~net.core.somaxconn~ — Max socket listen backlog
- ~vm.swappiness~ — Swap usage preference (0-100)
- ~fs.file-max~ — Max open files system-wide

** Q: What is dmesg and how do I use it?

dmesg shows kernel ring buffer (boot and system messages):

#+BEGIN_SRC bash
dmesg                               # Show all messages
dmesg | tail -50                    # Last 50 messages
dmesg -l err                        # Only errors
dmesg --level=warn,err              # Warnings and errors
dmesg -H                            # Human-readable timestamps
dmesg -w                            # Follow in real-time
journalctl -b                       # Alternative: systemd journal
#+END_SRC

Useful for:
- Hardware detection issues
- Driver problems
- Kernel panics
- System failures

