public/posts/linux-os.html
<div id="outline-container-org7a33f2b" class="outline-3">
<h3 id="org7a33f2b">Q: What is Access Control Lists (ACLs)?</h3>
<div class="outline-text-3" id="text-org7a33f2b">
<p>
ACLs provide more granular permission control than traditional permissions:
</p>

<div class="org-src-container">
<pre class="src src-bash">getfacl file.txt                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">View ACL
</span>setfacl -m u:username:rwx file.txt  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Give user permissions
</span>setfacl -m g:groupname:rx file.txt  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Give group permissions
</span>setfacl -x u:username file.txt      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove user ACL
</span>setfacl -b file.txt                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove all ACLs</span>
</pre>
</div>

<p>
ACL entry format: <code>[u|g]:[name]:[permissions]</code>
</p>
<ul class="org-ul">
<li><code>u</code> — User</li>
<li><code>g</code> — Group</li>
<li>No name — Applies to owner/owning group</li>
<li>Permissions: r=4, w=2, x=1</li>
</ul>
</div>
</div>
<div id="outline-container-org1ec7b4f" class="outline-3">
<h3 id="org1ec7b4f">Q: What is SELinux and how is it different from standard permissions?</h3>
<div class="outline-text-3" id="text-org1ec7b4f">
<p>
SELinux (Security-Enhanced Linux) provides Mandatory Access Control (MAC):
</p>

<ul class="org-ul">
<li>Standard permissions: Discretionary (user can change)</li>
<li>SELinux: Mandatory (enforced by policy)</li>
</ul>

<p>
SELinux context: <code>user_u:role_r:type_t:level_s</code>
</p>

<p>
States:
</p>

<ul class="org-ul">
<li>Enforcing — Policies enforced</li>
<li>Permissive — Violations logged but not enforced</li>
<li>Disabled — SELinux disabled</li>
</ul>

<p>
Commands:
</p>

<div class="org-src-container">
<pre class="src src-bash">getenforce                          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Get current state
</span>setenforce 0                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set permissive
</span>setenforce 1                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Set enforcing
</span>ls -Z                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show SELinux context
</span>ps -Z                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Process context
</span>chcon -t httpd_sys_content_t file   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change context
</span>restorecon -v file                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Restore default context</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0b075eb" class="outline-3">
<h3 id="org0b075eb">Q: How do I use sudo effectively and securely?</h3>
<div class="outline-text-3" id="text-org0b075eb">
<p>
sudo configuration in <code>/etc/sudoers</code> (edit with <code>sudo visudo</code>):
</p>

<div class="org-src-container">
<pre class="src src-nil">user1 ALL=(ALL) ALL                 # Full sudo access
user1 ALL=(ALL) NOPASSWD: ALL       # No password required
%wheel ALL=(ALL) ALL                # All group members
user1 ALL=(ALL) /usr/bin/ls         # Only specific command
</pre>
</div>

<p>
Logging:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo -l                             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List permitted commands
</span>sudo -i                             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Login as root
</span>sudo -u username command            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Run as specific user
</span>cat /var/log/auth.log | grep sudo   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">View sudo usage</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdeb1f00" class="outline-3">
<h3 id="orgdeb1f00">Q: What is the Linux kernel and how does it manage resources?</h3>
<div class="outline-text-3" id="text-orgdeb1f00">
<p>
The kernel is the core managing:
</p>

<ul class="org-ul">
<li><b>Process management</b> — Scheduling, context switching, resource allocation</li>
<li><b>Memory management</b> — Virtual memory, paging, memory protection</li>
<li><b>I/O management</b> — Device drivers, interrupts</li>
<li><b>Filesystem</b> — File operations, permissions, mounting</li>
<li><b>Networking</b> — Network protocols, packet processing</li>
<li><b>Interrupt handling</b> — Hardware and software interrupts</li>
</ul>

<p>
Check kernel: <code>uname -r</code>, <code>cat /proc/version</code>
</p>
</div>
</div>
<div id="outline-container-orge213bdd" class="outline-3">
<h3 id="orge213bdd">Q: What are kernel modules and how do I work with them?</h3>
<div class="outline-text-3" id="text-orge213bdd">
<p>
Loadable Kernel Modules (LKM) extend kernel without recompiling:
</p>

<div class="org-src-container">
<pre class="src src-bash">lsmod                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List loaded modules
</span>modinfo module_name                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Module information
</span>modprobe module_name                <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load with dependencies
</span>modprobe -r module_name             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove module
</span>insmod /path/to/module.ko           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load directly
</span>rmmod module_name                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Unload directly</span>
</pre>
</div>

<p>
Locations: <code>/lib/modules/$(uname -r)/kernel/</code>
</p>
</div>
</div>
<div id="outline-container-orgd394f0e" class="outline-3">
<h3 id="orgd394f0e">Q: How do I tune kernel parameters with sysctl?</h3>
<div class="outline-text-3" id="text-orgd394f0e">
<p>
Kernel parameters in <code>/proc/sys/</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">sysctl -a                           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show all parameters
</span>sysctl kernel.panic                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show specific parameter
</span>sysctl -w kernel.panic=10           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Change parameter
</span>sysctl -p                           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load from /etc/sysctl.conf</span>
</pre>
</div>

<p>
Persistent configuration in <code>/etc/sysctl.conf</code>:
</p>

<div class="org-src-container">
<pre class="src src-nil">kernel.panic = 10
net.core.somaxconn = 1024
net.ipv4.tcp_max_syn_backlog = 2048
vm.swappiness = 10
</pre>
</div>

<p>
Important parameters:
</p>
<ul class="org-ul">
<li><code>kernel.panic</code> — Seconds before reboot on panic</li>
<li><code>net.core.somaxconn</code> — Max socket listen backlog</li>
<li><code>vm.swappiness</code> — Swap usage preference (0-100)</li>
<li><code>fs.file-max</code> — Max open files system-wide</li>
</ul>
</div>
</div>
<div id="outline-container-org10a72da" class="outline-3">
<h3 id="org10a72da">Q: What is dmesg and how do I use it?</h3>
<div class="outline-text-3" id="text-org10a72da">
<p>
dmesg shows kernel ring buffer (boot and system messages):
</p>

<div class="org-src-container">
<pre class="src src-bash">dmesg                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show all messages
</span>dmesg | tail -50                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Last 50 messages
</span>dmesg -l err                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Only errors
</span>dmesg --level=warn,err              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Warnings and errors
</span>dmesg -H                            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Human-readable timestamps
</span>dmesg -w                            <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Follow in real-time
</span>journalctl -b                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Alternative: systemd journal</span>
</pre>
</div>

<p>
Useful for:
</p>
<ul class="org-ul">
<li>Hardware detection issues</li>
<li>Driver problems</li>
<li>Kernel panics</li>
<li>System failures</li>
</ul>
</div>
</div>
