org/posts/linux-os.org
** Q: How do I work with logical volumes (LVM)?

LVM abstracts physical disks:

#+BEGIN_SRC bash
# Physical volumes
pvcreate /dev/sda1 /dev/sdb1        # Create PV
pvs                                 # List PVs

# Volume groups
vgcreate vg0 /dev/sda1              # Create VG
vgs                                 # List VGs
vgextend vg0 /dev/sdb1              # Add to VG

# Logical volumes
lvcreate -L 10G -n lv0 vg0          # Create LV
lvs                                 # List LVs
lvextend -L +5G /dev/vg0/lv0        # Grow LV
resize2fs /dev/vg0/lv0              # Resize filesystem
#+END_SRC

** Q: How do I set up and manage RAID?

RAID combines multiple disks:

RAID levels:

- *RAID 0* — Striping only (no redundancy)
- *RAID 1* — Mirroring (full redundancy)
- *RAID 5* — Striping with parity (1 disk loss tolerance)
- *RAID 6* — Dual parity (2 disk loss tolerance)
- *RAID 10* — Mirrored stripe

Setup with mdadm:

#+BEGIN_SRC bash
mdadm --create /dev/md0 --level=5 --raid-devices=3 \
  /dev/sda1 /dev/sdb1 /dev/sdc1
cat /proc/mdstat                    # RAID status
mdadm --detail /dev/md0             # Detailed status
#+END_SRC

** Q: How do I encrypt filesystems with LUKS?

LUKS (Linux Unified Key Setup) full-disk encryption:

#+BEGIN_SRC bash
sudo cryptsetup luksFormat /dev/sdb1  # Create encrypted volume
sudo cryptsetup luksOpen /dev/sdb1 myvolume  # Open (mount)
sudo mkfs.ext4 /dev/mapper/myvolume  # Format
sudo mount /dev/mapper/myvolume /mnt/data
sudo cryptsetup luksClose myvolume    # Close (unmount)
#+END_SRC

Key management:

#+BEGIN_SRC bash
cryptsetup luksAddKey /dev/sdb1      # Add key
cryptsetup luksRemoveKey /dev/sdb1   # Remove key
cryptsetup luksDump /dev/sdb1        # Show info
#+END_SRC

** Q: How do I work with different filesystems?

Common filesystems:

*ext4* (default):

#+BEGIN_SRC bash
mkfs.ext4 /dev/sda1                # Create
tune2fs -l /dev/sda1               # Get properties
e2fsck -f /dev/sda1                # Repair (unmounted)
#+END_SRC

*XFS* (high performance):

#+BEGIN_SRC bash
mkfs.xfs /dev/sda1
xfs_info /dev/sda1
xfs_repair /dev/sda1               # Repair (unmounted)
#+END_SRC

*Btrfs* (modern):

#+BEGIN_SRC bash
mkfs.btrfs /dev/sda1
btrfs filesystem show              # Show info
btrfs subvolume create /mnt/snap   # Snapshot
#+END_SRC

** Q: What is the difference between hard and soft links?

- *Hard link* — Direct reference to inode, same file, same size
  - ~ln file hardlink~
  - Survives original deletion if link exists
  - Cannot link across filesystems

- *Soft link (symlink)* — Reference to path, separate inode, shows target
  - ~ln -s file symlink~
  - Breaks if original deleted
  - Can link across filesystems

Check: ~ls -li~ shows inode; symlinks show target with ~->~ and start with =l=

** Q: What is /proc filesystem?

Virtual filesystem providing kernel/process information:

#+BEGIN_SRC bash
/proc/cpuinfo                       # CPU information
/proc/meminfo                       # Memory information
/proc/uptime                        # System uptime
/proc/loadavg                       # Load average
/proc/[PID]/                        # Process-specific info
/proc/[PID]/cmdline                 # Process command line
/proc/[PID]/status                  # Process status
/proc/[PID]/maps                    # Memory map
/proc/[PID]/fd/                     # File descriptors
/proc/mounts                        # Mounted filesystems
/proc/filesystems                   # Supported filesystems
/proc/net/tcp                       # TCP connections
#+END_SRC

** Q: What is an inode and why is it important?

Inode (index node) stores file metadata:

- File size
- Owner UID and GID
- Permissions (mode)
- Timestamps (atime, mtime, ctime)
- Link count (hard links)
- Block pointers (data location on disk)
- File type

View inode information:

#+BEGIN_SRC bash
ls -i file                          # Show inode number
stat file                           # Detailed inode info
#+END_SRC

Inode exhaustion:

#+BEGIN_SRC bash
df -i                               # Inode usage
find . -type f | wc -l              # Count files
#+END_SRC

-----

* Resources and Tips

