public/posts/linux-os.html
<div id="outline-container-org0cc5fea" class="outline-3">
<h3 id="org0cc5fea">Q: How do I work with logical volumes (LVM)?</h3>
<div class="outline-text-3" id="text-org0cc5fea">
<p>
LVM abstracts physical disks:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Physical volumes
</span>pvcreate /dev/sda1 /dev/sdb1        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create PV
</span>pvs                                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List PVs
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Volume groups
</span>vgcreate vg0 /dev/sda1              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create VG
</span>vgs                                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List VGs
</span>vgextend vg0 /dev/sdb1              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add to VG
</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Logical volumes
</span>lvcreate -L 10G -n lv0 vg0          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create LV
</span>lvs                                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">List LVs
</span>lvextend -L +5G /dev/vg0/lv0        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Grow LV
</span>resize2fs /dev/vg0/lv0              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Resize filesystem</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org344fa00" class="outline-3">
<h3 id="org344fa00">Q: How do I set up and manage RAID?</h3>
<div class="outline-text-3" id="text-org344fa00">
<p>
RAID combines multiple disks:
</p>

<p>
RAID levels:
</p>

<ul class="org-ul">
<li><b>RAID 0</b> — Striping only (no redundancy)</li>
<li><b>RAID 1</b> — Mirroring (full redundancy)</li>
<li><b>RAID 5</b> — Striping with parity (1 disk loss tolerance)</li>
<li><b>RAID 6</b> — Dual parity (2 disk loss tolerance)</li>
<li><b>RAID 10</b> — Mirrored stripe</li>
</ul>

<p>
Setup with mdadm:
</p>

<div class="org-src-container">
<pre class="src src-bash">mdadm --create /dev/md0 --level=5 --raid-devices=3 <span style="font-style: italic;">\</span>
  /dev/sda1 /dev/sdb1 /dev/sdc1
cat /proc/mdstat                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">RAID status
</span>mdadm --detail /dev/md0             <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Detailed status</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd31a828" class="outline-3">
<h3 id="orgd31a828">Q: How do I encrypt filesystems with LUKS?</h3>
<div class="outline-text-3" id="text-orgd31a828">
<p>
LUKS (Linux Unified Key Setup) full-disk encryption:
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo cryptsetup luksFormat /dev/sdb1  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create encrypted volume
</span>sudo cryptsetup luksOpen /dev/sdb1 myvolume  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Open (mount)
</span>sudo mkfs.ext4 /dev/mapper/myvolume  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Format
</span>sudo mount /dev/mapper/myvolume /mnt/data
sudo cryptsetup luksClose myvolume    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Close (unmount)</span>
</pre>
</div>

<p>
Key management:
</p>

<div class="org-src-container">
<pre class="src src-bash">cryptsetup luksAddKey /dev/sdb1      <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Add key
</span>cryptsetup luksRemoveKey /dev/sdb1   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Remove key
</span>cryptsetup luksDump /dev/sdb1        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show info</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgce7d57c" class="outline-3">
<h3 id="orgce7d57c">Q: How do I work with different filesystems?</h3>
<div class="outline-text-3" id="text-orgce7d57c">
<p>
Common filesystems:
</p>

<p>
<b>ext4</b> (default):
</p>

<div class="org-src-container">
<pre class="src src-bash">mkfs.ext4 /dev/sda1                <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create
</span>tune2fs -l /dev/sda1               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Get properties
</span>e2fsck -f /dev/sda1                <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Repair (unmounted)</span>
</pre>
</div>

<p>
<b>XFS</b> (high performance):
</p>

<div class="org-src-container">
<pre class="src src-bash">mkfs.xfs /dev/sda1
xfs_info /dev/sda1
xfs_repair /dev/sda1               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Repair (unmounted)</span>
</pre>
</div>

<p>
<b>Btrfs</b> (modern):
</p>

<div class="org-src-container">
<pre class="src src-bash">mkfs.btrfs /dev/sda1
btrfs filesystem show              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show info
</span>btrfs subvolume create /mnt/snap   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Snapshot</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcc404e0" class="outline-3">
<h3 id="orgcc404e0">Q: What is the difference between hard and soft links?</h3>
<div class="outline-text-3" id="text-orgcc404e0">
<ul class="org-ul">
<li><b>Hard link</b> — Direct reference to inode, same file, same size
<ul class="org-ul">
<li><code>ln file hardlink</code></li>
<li>Survives original deletion if link exists</li>
<li>Cannot link across filesystems</li>
</ul></li>

<li><b>Soft link (symlink)</b> — Reference to path, separate inode, shows target
<ul class="org-ul">
<li><code>ln -s file symlink</code></li>
<li>Breaks if original deleted</li>
<li>Can link across filesystems</li>
</ul></li>
</ul>

<p>
Check: <code>ls -li</code> shows inode; symlinks show target with <code>-&gt;</code> and start with <code>l</code>
</p>
</div>
</div>
<div id="outline-container-orgbff2a2c" class="outline-3">
<h3 id="orgbff2a2c">Q: What is /proc filesystem?</h3>
<div class="outline-text-3" id="text-orgbff2a2c">
<p>
Virtual filesystem providing kernel/process information:
</p>

<div class="org-src-container">
<pre class="src src-bash">/proc/cpuinfo                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">CPU information
</span>/proc/meminfo                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Memory information
</span>/proc/uptime                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">System uptime
</span>/proc/loadavg                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Load average
</span>/proc/[PID]/                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Process-specific info
</span>/proc/[PID]/cmdline                 <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Process command line
</span>/proc/[PID]/status                  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Process status
</span>/proc/[PID]/maps                    <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Memory map
</span>/proc/[PID]/fd/                     <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">File descriptors
</span>/proc/mounts                        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Mounted filesystems
</span>/proc/filesystems                   <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Supported filesystems
</span>/proc/net/tcp                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">TCP connections</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga5db4c2" class="outline-3">
<h3 id="orga5db4c2">Q: What is an inode and why is it important?</h3>
<div class="outline-text-3" id="text-orga5db4c2">
<p>
Inode (index node) stores file metadata:
</p>

<ul class="org-ul">
<li>File size</li>
<li>Owner UID and GID</li>
<li>Permissions (mode)</li>
<li>Timestamps (atime, mtime, ctime)</li>
<li>Link count (hard links)</li>
<li>Block pointers (data location on disk)</li>
<li>File type</li>
</ul>

<p>
View inode information:
</p>

<div class="org-src-container">
<pre class="src src-bash">ls -i file                          <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Show inode number
</span>stat file                           <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Detailed inode info</span>
</pre>
</div>

<p>
Inode exhaustion:
</p>

<div class="org-src-container">
<pre class="src src-bash">df -i                               <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Inode usage
</span>find . -type f | wc -l              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Count files</span>
</pre>
</div>

<hr>
</div>
</div>
</div>
<div id="outline-container-orgf9fc48c" class="outline-2">
<h2 id="orgf9fc48c">Resources and Tips</h2>
<div class="outline-text-2" id="text-orgf9fc48c">
</div>
